mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xh/s6e2c2xh.svd
        <!-- REGISTER "PPGC2" -->
        <register derivedFrom="PPGC0">
          <name>PPGC2</name>
          <description>PPG Operation Mode Control Register 2 [BHW]</description>
          <addressOffset>0x205</addressOffset>
        </register>
        <!-- REGISTER "PPGC3" -->
        <register derivedFrom="PPGC1">
          <name>PPGC3</name>
          <description>PPG Operation Mode Control Register 3 [BHW]</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "PPGC4" -->
        <register derivedFrom="PPGC0">
          <name>PPGC4</name>
          <description>PPG Operation Mode Control Register 4 [BHW]</description>
          <addressOffset>0x241</addressOffset>
        </register>
        <!-- REGISTER "PPGC5" -->
        <register derivedFrom="PPGC1">
          <name>PPGC5</name>
          <description>PPG Operation Mode Control Register 5 [BHW]</description>
          <addressOffset>0x240</addressOffset>
        </register>
        <!-- REGISTER "PPGC6" -->
        <register derivedFrom="PPGC0">
          <name>PPGC6</name>
          <description>PPG Operation Mode Control Register 6 [BHW]</description>
          <addressOffset>0x245</addressOffset>
        </register>
        <!-- REGISTER "PPGC7" -->
        <register derivedFrom="PPGC1">
          <name>PPGC7</name>
          <description>PPG Operation Mode Control Register 7 [BHW]</description>
          <addressOffset>0x244</addressOffset>
        </register>
        <!-- REGISTER "PPGC8" -->
        <register derivedFrom="PPGC0">
          <name>PPGC8</name>
          <description>PPG Operation Mode Control Register 8 [BHW]</description>
          <addressOffset>0x281</addressOffset>
        </register>
        <!-- REGISTER "PPGC9" -->
        <register derivedFrom="PPGC1">
          <name>PPGC9</name>
          <description>PPG Operation Mode Control Register 9 [BHW]</description>
          <addressOffset>0x280</addressOffset>
        </register>
        <!-- REGISTER "PPGC10" -->
        <register derivedFrom="PPGC0">
          <name>PPGC10</name>
          <description>PPG Operation Mode Control Register 10 [BHW]</description>
          <addressOffset>0x285</addressOffset>
        </register>
        <!-- REGISTER "PPGC11" -->
        <register derivedFrom="PPGC1">
          <name>PPGC11</name>
          <description>PPG Operation Mode Control Register 11 [BHW]</description>
          <addressOffset>0x284</addressOffset>
        </register>
        <!-- REGISTER "PPGC12" -->
        <register derivedFrom="PPGC0">
          <name>PPGC12</name>
          <description>PPG Operation Mode Control Register 12 [BHW]</description>
          <addressOffset>0x2C1</addressOffset>
        </register>
        <!-- REGISTER "PPGC13" -->
        <register derivedFrom="PPGC1">
          <name>PPGC13</name>
          <description>PPG Operation Mode Control Register 13 [BHW]</description>
          <addressOffset>0x2C0</addressOffset>
        </register>
        <!-- REGISTER "PPGC14" -->
        <register derivedFrom="PPGC0">
          <name>PPGC14</name>
          <description>PPG Operation Mode Control Register 14 [BHW]</description>
          <addressOffset>0x2C5</addressOffset>
        </register>
        <!-- REGISTER "PPGC15" -->
        <register derivedFrom="PPGC1">
          <name>PPGC15</name>
          <description>PPG Operation Mode Control Register 15 [BHW]</description>
          <addressOffset>0x2C4</addressOffset>
        </register>
        <!-- REGISTER "PPGC16" -->
        <register derivedFrom="PPGC0">
          <name>PPGC16</name>
          <description>PPG Operation Mode Control Register 16 [BHW]</description>
          <addressOffset>0x301</addressOffset>
        </register>
        <!-- REGISTER "PPGC17" -->
        <register derivedFrom="PPGC1">
          <name>PPGC17</name>
          <description>PPG Operation Mode Control Register 17 [BHW]</description>
          <addressOffset>0x300</addressOffset>
        </register>
        <!-- REGISTER "PPGC18" -->
        <register derivedFrom="PPGC0">
          <name>PPGC18</name>
          <description>PPG Operation Mode Control Register 18 [BHW]</description>
          <addressOffset>0x305</addressOffset>
        </register>
        <!-- REGISTER "PPGC19" -->
        <register derivedFrom="PPGC1">
          <name>PPGC19</name>
          <description>PPG Operation Mode Control Register 19 [BHW]</description>
          <addressOffset>0x304</addressOffset>
        </register>
        <!-- REGISTER "PPGC20" -->
        <register derivedFrom="PPGC0">
          <name>PPGC20</name>
          <description>PPG Operation Mode Control Register 20 [BHW]</description>
          <addressOffset>0x341</addressOffset>
        </register>
        <!-- REGISTER "PPGC21" -->
        <register derivedFrom="PPGC1">
          <name>PPGC21</name>
          <description>PPG Operation Mode Control Register 21 [BHW]</description>
          <addressOffset>0x340</addressOffset>
        </register>
        <!-- REGISTER "PPGC22" -->
        <register derivedFrom="PPGC0">
          <name>PPGC22</name>
          <description>PPG Operation Mode Control Register 22 [BHW]</description>
          <addressOffset>0x345</addressOffset>
        </register>
        <!-- REGISTER "PPGC23" -->
        <register derivedFrom="PPGC1">
          <name>PPGC23</name>
          <description>PPG Operation Mode Control Register 23 [BHW]</description>
          <addressOffset>0x344</addressOffset>
        </register>
        <!-- REGISTER "PRLH0" -->
        <register>
          <name>PRLH0</name>
          <description>PPG0 Reload Registers High [BHW]</description>
          <addressOffset>0x209</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLH" -->
            <field>
              <name>PRLH</name>
              <description>Reload Registers High</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRLL0" -->
        <register>
          <name>PRLL0</name>
          <description>PPG0 Reload Registers Low [BHW]</description>
          <addressOffset>0x208</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLL" -->
            <field>
              <name>PRLL</name>
              <description>Reload Registers Low</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
