mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xh/s6e2c2xh.svd
        <!-- REGISTER "MAR18H" -->
        <register derivedFrom="MAR1H">
          <name>MAR18H</name>
          <description>MAC Address18 Register -High [BHW]</description>
          <addressOffset>0x810</addressOffset>
        </register>
        <!-- REGISTER "MAR18L" -->
        <register derivedFrom="MAR1L">
          <name>MAR18L</name>
          <description>MAC Address18 Register -Low [BHW]</description>
          <addressOffset>0x814</addressOffset>
        </register>
        <!-- REGISTER "MAR19H" -->
        <register derivedFrom="MAR1H">
          <name>MAR19H</name>
          <description>MAC Address19 Register -High [BHW]</description>
          <addressOffset>0x818</addressOffset>
        </register>
        <!-- REGISTER "MAR19L" -->
        <register derivedFrom="MAR1L">
          <name>MAR19L</name>
          <description>MAC Address19 Register -Low [BHW]</description>
          <addressOffset>0x81C</addressOffset>
        </register>
        <!-- REGISTER "MAR20H" -->
        <register derivedFrom="MAR1H">
          <name>MAR20H</name>
          <description>MAC Address20 Register -High [BHW]</description>
          <addressOffset>0x820</addressOffset>
        </register>
        <!-- REGISTER "MAR20L" -->
        <register derivedFrom="MAR1L">
          <name>MAR20L</name>
          <description>MAC Address20 Register -Low [BHW]</description>
          <addressOffset>0x824</addressOffset>
        </register>
        <!-- REGISTER "MAR21H" -->
        <register derivedFrom="MAR1H">
          <name>MAR21H</name>
          <description>MAC Address21 Register -High [BHW]</description>
          <addressOffset>0x828</addressOffset>
        </register>
        <!-- REGISTER "MAR21L" -->
        <register derivedFrom="MAR1L">
          <name>MAR21L</name>
          <description>MAC Address21 Register -Low [BHW]</description>
          <addressOffset>0x82C</addressOffset>
        </register>
        <!-- REGISTER "MAR22H" -->
        <register derivedFrom="MAR1H">
          <name>MAR22H</name>
          <description>MAC Address22 Register -High [BHW]</description>
          <addressOffset>0x830</addressOffset>
        </register>
        <!-- REGISTER "MAR22L" -->
        <register derivedFrom="MAR1L">
          <name>MAR22L</name>
          <description>MAC Address22 Register -Low [BHW]</description>
          <addressOffset>0x834</addressOffset>
        </register>
        <!-- REGISTER "MAR23H" -->
        <register derivedFrom="MAR1H">
          <name>MAR23H</name>
          <description>MAC Address23 Register -High [BHW]</description>
          <addressOffset>0x838</addressOffset>
        </register>
        <!-- REGISTER "MAR23L" -->
        <register derivedFrom="MAR1L">
          <name>MAR23L</name>
          <description>MAC Address23 Register -Low [BHW]</description>
          <addressOffset>0x83C</addressOffset>
        </register>
        <!-- REGISTER "MAR24H" -->
        <register derivedFrom="MAR1H">
          <name>MAR24H</name>
          <description>MAC Address24 Register -High [BHW]</description>
          <addressOffset>0x840</addressOffset>
        </register>
        <!-- REGISTER "MAR24L" -->
        <register derivedFrom="MAR1L">
          <name>MAR24L</name>
          <description>MAC Address24 Register -Low [BHW]</description>
          <addressOffset>0x844</addressOffset>
        </register>
        <!-- REGISTER "MAR25H" -->
        <register derivedFrom="MAR1H">
          <name>MAR25H</name>
          <description>MAC Address25 Register -High [BHW]</description>
          <addressOffset>0x848</addressOffset>
        </register>
        <!-- REGISTER "MAR25L" -->
        <register derivedFrom="MAR1L">
          <name>MAR25L</name>
          <description>MAC Address25 Register -Low [BHW]</description>
          <addressOffset>0x84C</addressOffset>
        </register>
        <!-- REGISTER "MAR26H" -->
        <register derivedFrom="MAR1H">
          <name>MAR26H</name>
          <description>MAC Address26 Register -High [BHW]</description>
          <addressOffset>0x850</addressOffset>
        </register>
        <!-- REGISTER "MAR26L" -->
        <register derivedFrom="MAR1L">
          <name>MAR26L</name>
          <description>MAC Address26 Register -Low [BHW]</description>
          <addressOffset>0x854</addressOffset>
        </register>
        <!-- REGISTER "MAR27H" -->
        <register derivedFrom="MAR1H">
          <name>MAR27H</name>
          <description>MAC Address27 Register -High [BHW]</description>
          <addressOffset>0x858</addressOffset>
        </register>
        <!-- REGISTER "MAR27L" -->
        <register derivedFrom="MAR1L">
          <name>MAR27L</name>
          <description>MAC Address27 Register -Low [BHW]</description>
          <addressOffset>0x85C</addressOffset>
        </register>
        <!-- REGISTER "MAR28H" -->
        <register derivedFrom="MAR1H">
          <name>MAR28H</name>
          <description>MAC Address28 Register -High [BHW]</description>
          <addressOffset>0x860</addressOffset>
        </register>
        <!-- REGISTER "MAR28L" -->
        <register derivedFrom="MAR1L">
          <name>MAR28L</name>
          <description>MAC Address28 Register -Low [BHW]</description>
          <addressOffset>0x864</addressOffset>
        </register>
        <!-- REGISTER "MAR29H" -->
        <register derivedFrom="MAR1H">
          <name>MAR29H</name>
          <description>MAC Address29 Register -High [BHW]</description>
          <addressOffset>0x868</addressOffset>
        </register>
        <!-- REGISTER "MAR29L" -->
        <register derivedFrom="MAR1L">
          <name>MAR29L</name>
          <description>MAC Address29 Register -Low [BHW]</description>
          <addressOffset>0x86C</addressOffset>
        </register>
        <!-- REGISTER "MAR30H" -->
        <register derivedFrom="MAR1H">
          <name>MAR30H</name>
          <description>MAC Address30 Register -High [BHW]</description>
          <addressOffset>0x870</addressOffset>
        </register>
